---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.Normal
source: html/68918075-117f-1c3a-83cc-3ebf2b557c9f.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.Normal Property

The vertex's normal vector.

## Syntax (C#)
```csharp
public XYZ Normal { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null